tap "alxsad/ipmon"
tap "dbcli/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "hudochenkov/sshpass"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "minio/stable"
tap "mykolaharmash/git-jump"
tap "possatti/possatti"
tap "trntv/sshed"
tap "umputun/apps"
tap "vmware-tanzu/carvel"
brew "sqlite"
brew "ansible"
brew "argon2"
brew "arp-scan"
brew "python@3.12"
brew "asciinema"
brew "awscli"
brew "bandwhich"
brew "libgit2"
brew "bat"
brew "node"
brew "bit"
brew "bit-git", link: false
brew "osx-cpu-temp"
brew "python@3.11"
brew "bpytop"
brew "broot"
brew "python-setuptools"
brew "glib"
brew "cheat"
brew "clang-format"
brew "cmatrix"
brew "cointop"
brew "lima"
brew "colima"
brew "curl"
brew "php"
brew "composer"
brew "coreutils"
brew "cowsay"
brew "ctop"
brew "dive"
brew "dnscrypt-proxy", restart_service: :changed
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "dog"
brew "drone-cli"
brew "duf"
brew "dust"
brew "espeak"
brew "etcd"
brew "eza"
brew "fd"
brew "fx"
brew "fzf"
brew "gdu"
brew "harfbuzz"
brew "ghostscript"
brew "git-delta"
brew "gitui"
brew "glances"
brew "gnu-sed"
brew "gnutls"
brew "libusb"
brew "gnupg"
brew "go"
brew "go@1.20"
brew "golang-migrate"
brew "goreleaser"
brew "gping"
brew "graphviz"
brew "grc"
brew "hashcat"
brew "helm"
brew "hstr"
brew "htop"
brew "httpie"
brew "hub"
brew "hugo"
brew "hurl"
brew "libheif"
brew "imagemagick"
brew "iproute2mac"
brew "jose"
brew "k3d"
brew "k9s"
brew "openjdk"
brew "kafka"
brew "knock"
brew "kubernetes-cli"
brew "kubectx"
brew "lazydocker"
brew "lazygit"
brew "lnav"
brew "lolcat"
brew "lsd"
brew "mactop"
brew "mailhog"
brew "mas"
brew "mcfly"
brew "md5sha1sum", link: false
brew "micro"
brew "midnight-commander"
brew "minikube"
brew "mosquitto"
brew "mplayer"
brew "mutt"
brew "mysql"
brew "mysql-client"
brew "mysql-client@8.4"
brew "n"
brew "nasm"
brew "navi"
brew "ncdu"
brew "neofetch"
brew "nmap"
brew "noti"
brew "oath-toolkit"
brew "openjdk@11"
brew "openvpn"
brew "perl"
brew "pgcli"
brew "pipes-sh"
brew "pipx"
brew "pkgconf"
brew "postgresql@14"
brew "postgresql@15"
brew "procs"
brew "progress"
brew "protobuf"
brew "pwgen"
brew "python@3.9"
brew "redis"
brew "ripgrep"
brew "rustscan"
brew "scc"
brew "speedtest-cli"
brew "starship"
brew "swagger-codegen"
brew "telnet"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "trash", link: true
brew "tree"
brew "vault"
brew "vim"
brew "watch"
brew "wget"
brew "wifi-password"
brew "wireguard-tools"
brew "yarn"
brew "youtube-dl"
brew "yq"
brew "zbar"
brew "zoxide"
brew "zsh-completions"
brew "alxsad/ipmon/ipmon"
brew "mykolaharmash/git-jump/git-jump"
brew "umputun/apps/weblist"
cask "brewservicesmenubar"
cask "chatgpt"
cask "dbeaver-community"
cask "devtoys"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "ghostty"
cask "jordanbaird-ice"
cask "maccy"
cask "macfuse"
cask "ngrok"
cask "openemu"
cask "openvpn-connect"
cask "postman"
cask "raycast"
cask "rectangle"
cask "slack"
cask "spotify"
cask "stats"
cask "tiles"
cask "tunnelblick"
cask "visual-studio-code"
cask "vlc"
cask "vscodium"
cask "wireshark"
mas "Bitwarden", id: 1352778147
mas "Boop", id: 1518425043
mas "etcdWP", id: 1617626187
mas "Hand Mirror", id: 1502839586
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LanScan", id: 472226235
mas "Lightshot Screenshot", id: 526298438
mas "LilyView", id: 529490330
mas "Mattermost", id: 1614666244
mas "MKPlayer", id: 1335612105
mas "NetSpot", id: 514951692
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "RapidSnap", id: 1662117950
mas "Telegram", id: 747648890
mas "Tot", id: 1491071483
mas "Transmission", id: 6448612045
mas "Ultra Wifi", id: 1664371307
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "bmewburn.vscode-intelephense-client"
vscode "codezombiech.gitignore"
vscode "continue.continue"
vscode "coolbear.systemd-unit-file"
vscode "dominicvonk.parameter-hints"
vscode "donjayamanne.githistory"
vscode "editorconfig.editorconfig"
vscode "formulahendry.code-runner"
vscode "george-alisson.html-preview-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "humao.rest-client"
vscode "jacobpfeifer.pfeifer-hurl"
vscode "jeff-hykin.better-cpp-syntax"
vscode "johnpapa.vscode-peacock"
vscode "junstyle.php-cs-fixer"
vscode "laggardkernel.vscode-theme-onelight"
vscode "liuchao.go-struct-tag"
vscode "maattdd.gitless"
vscode "marabesi.php-import-checker"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "premparihar.gotestexplorer"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "seripap.vscode-memory"
vscode "sleistner.vscode-fileutils"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudioexptteam.vscodeintellicode-completions"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "whatwedo.twig"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
