tap "alxsad/ipmon"
tap "dbcli/tap"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "minio/stable"
tap "mykolaharmash/git-jump"
tap "umputun/apps"
# Command-line interface for SQLite
brew "sqlite"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Password hashing library and CLI utility
brew "argon2"
# ARP scanning and fingerprinting tool
brew "arp-scan"
# Record and share terminal sessions
brew "asciinema"
# Official Amazon AWS command-line interface
brew "awscli"
# Terminal bandwidth utilization tool
brew "bandwhich"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Distributed Code Component Manager
brew "bit"
# Bit is a modern Git CLI
brew "bit-git", link: false
# Outputs current CPU temperature for OSX
brew "osx-cpu-temp"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Linux/OSX/FreeBSD resource monitor
brew "bpytop"
# New way to see and navigate directory trees
brew "broot"
# Core application library for C
brew "glib"
# Easily download, build, install, upgrade, and uninstall Python packages
brew "python-setuptools"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Console Matrix
brew "cmatrix"
# Interactive terminal based UI application for tracking cryptocurrencies
brew "cointop"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Top-like interface for container metrics
brew "ctop"
# Tool for exploring each layer in a docker image
brew "dive"
# Secure communications between a client and a DNS resolver
brew "dnscrypt-proxy", restart_service: :changed
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Command-line DNS client
brew "dog"
# Command-line client for the Drone continuous integration server
brew "drone-cli"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Text to speech, software speech synthesizer
brew "espeak"
# Key value store for shared configuration and service discovery
brew "etcd"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# GitHub command-line tool
brew "gh"
# OpenType text shaping engine
brew "harfbuzz"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# Alternative to top/htop
brew "glances"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Library for USB device access
brew "libusb"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Database migrations CLI tool
brew "golang-migrate"
# Go Language's command-line interface for database migrations
brew "goose"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# Ping, but with a graph
brew "gping"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Colorize logfiles and command output
brew "grc"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# Kubernetes package manager
brew "helm"
# Bash and zsh history suggest box
brew "hstr"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Run and Test HTTP Requests with plain text and curl
brew "hurl"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# C-language implementation of Javascript Object Signing and Encryption
brew "jose"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Development kit for the Java programming language
brew "openjdk"
# Open-source distributed event streaming platform
brew "kafka"
# Port-knock server
brew "knock"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Apple Silicon Monitor Top written in Go Lang
brew "mactop"
# Mac App Store command-line interface
brew "mas"
# Fly through your shell history
brew "mcfly"
# Hash utilities
brew "md5sha1sum"
# Modern and intuitive terminal-based text editor
brew "micro"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Terminal-based visual file manager
brew "midnight-commander"
# Run a Kubernetes cluster locally
brew "minikube"
# Message broker implementing the MQTT protocol
brew "mosquitto"
# UNIX movie player
brew "mplayer"
# Mongrel of mail user agents (part elm, pine, mush, mh, etc.)
brew "mutt"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Open source relational database management system
brew "mysql"
# Open source relational database management system
brew "mysql-client"
# Open source relational database management system
brew "mysql-client@8.4"
# Node version management
brew "n"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Interactive cheatsheet tool for the command-line
brew "navi"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Port scanning utility for large networks
brew "nmap"
# Trigger notifications when a process completes
brew "noti"
# Tools for one-time password authentication systems
brew "oath-toolkit"
# Development kit for the Java programming language
brew "openjdk@11"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Highly capable, feature-rich programming language
brew "perl"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Animated pipes terminal screensaver
brew "pipes-sh"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Object-relational database system
brew "postgresql@14"
# Object-relational database system
brew "postgresql@15"
# Modern replacement for ps written in Rust
brew "procs"
# Coreutils progress viewer
brew "progress"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Modern Day Portscanner
brew "rustscan"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Prettier way to inspect network connections
brew "snitch"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Generate clients, server stubs, and docs from an OpenAPI spec
brew "swagger-codegen"
# User interface to the TELNET protocol
brew "telnet"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Show the current WiFi network password
brew "wifi-password"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Suite of barcodes-reading tools
brew "zbar"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Additional completion definitions for zsh
brew "zsh-completions"
# zero dependency ip address monitoring
brew "alxsad/ipmon/ipmon"
# Git branches helper: interactive UI and fuzzy-serach for Git branches
brew "mykolaharmash/git-jump/git-jump"
# weblist is a self-hosted web service to access local files and folders
brew "umputun/apps/weblist"
# Menu item for starting and stopping homebrew services
cask "brewservicesmenubar"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Web browser
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# File system integration
cask "macfuse"
# Create mock APIs in seconds
cask "mockoon"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# Collaboration platform for API development
cask "postman"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
mas "AdGuard Mini", id: 1440147259
mas "Bitwarden", id: 1352778147
mas "Elmedia Video Player", id: 1044549675
mas "Hand Mirror", id: 1502839586
mas "Infuse", id: 1136220934
mas "IPTV Expert", id: 1641944027
mas "Keynote", id: 409183694
mas "LanScan", id: 472226235
mas "Lightshot Screenshot", id: 526298438
mas "LilyView", id: 529490330
mas "MKPlayer", id: 1335612105
mas "NetSpot", id: 514951692
mas "Numbers", id: 409203825
mas "Okta Verify", id: 490179405
mas "Pages", id: 409201541
mas "Telegram", id: 747648890
mas "Ultra Wifi", id: 1664371307
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
go "pgw.dev/lib/fbk/contract-gen/cmd/contract-gen"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/mikekonan/go-oas3"
go "github.com/nicksnyder/go-i18n/v2/goi18n"
go "golang.org/x/tools/cmd/goimports"
go "github.com/incu6us/goimports-reviser/v3"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "gotest.tools/gotestsum"
go "github.com/jmattheis/goverter/cmd/goverter"
go "github.com/hexdigest/gowrap/cmd/gowrap"
go "pgw.dev/lib/gowsdl/cmd/gowsdl"
go "pgw.dev/ops/ikea"
go "pgw.dev/ops/integration-generator/cmd/integration-gen"
go "github.com/birdayz/kaf/cmd/kaf"
go "pgw.dev/ops/swiss-knife/v4/cmd/knife"
go "github.com/minio/mc"
go "github.com/golang-migrate/migrate/v4/cmd/migrate"
go "go.uber.org/mock/mockgen"
go "github.com/HnH/qry/cmd/qry-gen"
go "github.com/houqp/sqlvet"
go "honnef.co/go/tools/cmd/staticcheck"
go "pgw.dev/ops/swiss-knife/v4"
go "go.k6.io/xk6/cmd/xk6"
go "github.com/traefik/yaegi/cmd/yaegi"
go "github.com/mikefarah/yq/v4"
