tap "dbcli/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "hudochenkov/sshpass"
tap "mykolaharmash/git-jump"
tap "possatti/possatti"
tap "trntv/sshed"
tap "vmware-tanzu/carvel"
brew "sqlite"
brew "ansible"
brew "argon2"
brew "arp-scan"
brew "asciinema"
brew "awscli"
brew "bandwhich"
brew "bat"
brew "node"
brew "bit"
brew "bit-git", link: false
brew "osx-cpu-temp"
brew "bpytop"
brew "pkg-config"
brew "broot"
brew "glib"
brew "cheat"
brew "clang-format"
brew "cmatrix"
brew "cointop"
brew "gnutls"
brew "libusb"
brew "colima"
brew "curl"
brew "php"
brew "composer"
brew "coreutils", link: false
brew "cowsay"
brew "ctop"
brew "dive"
brew "dnsmasq", restart_service: true
brew "docker"
brew "dog"
brew "drone-cli"
brew "duf"
brew "dust"
brew "espeak"
brew "etcd"
brew "exa"
brew "fd"
brew "fx"
brew "fzf"
brew "gdu"
brew "git-delta"
brew "gitui"
brew "glances"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "golang-migrate"
brew "gping"
brew "harfbuzz"
brew "graphviz"
brew "grc"
brew "hashcat"
brew "helm"
brew "hstr"
brew "htop"
brew "httpie"
brew "hub"
brew "hugo"
brew "hurl"
brew "libheif"
brew "imagemagick"
brew "iproute2mac"
brew "jose"
brew "jq"
brew "k3d"
brew "k9s"
brew "openjdk"
brew "kafka"
brew "kubernetes-cli"
brew "kubectx"
brew "lazydocker"
brew "lazygit"
brew "lnav"
brew "lolcat"
brew "lsd"
brew "mailhog"
brew "mas"
brew "mcfly"
brew "md5sha1sum", link: false
brew "midnight-commander"
brew "minikube"
brew "mosquitto"
brew "mutt"
brew "protobuf"
brew "mysql", restart_service: true
brew "mysql-client"
brew "n"
brew "nasm"
brew "navi"
brew "ncdu"
brew "neofetch"
brew "nmap"
brew "noti"
brew "perl"
brew "pgcli"
brew "postgresql@14"
brew "procs"
brew "progress"
brew "pwgen"
brew "python@3.9"
brew "redis", restart_service: true
brew "ripgrep"
brew "scc"
brew "speedtest-cli"
brew "starship"
brew "swagger-codegen"
brew "telnet"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "trash"
brew "tree"
brew "vault"
brew "vim"
brew "watch"
brew "wget"
brew "wifi-password"
brew "yarn"
brew "youtube-dl"
brew "zbar"
brew "zoxide"
brew "zsh-completions"
brew "mykolaharmash/git-jump/git-jump"
brew "vmware-tanzu/carvel/ytt"
cask "bluetility"
cask "cakebrew"
cask "dbeaver-community"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "maccy"
cask "macfuse"
cask "ngrok"
cask "stats"
cask "tiles"
cask "vscodium"
cask "wireshark"
mas "Boop", id: 1518425043
mas "feedly", id: 865500966
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LanScan", id: 472226235
mas "Lightshot Screenshot", id: 526298438
mas "LilyView", id: 529490330
mas "Microsoft Remote Desktop", id: 1295203466
mas "MKPlayer", id: 1335612105
mas "MQTT Explorer", id: 1455214828
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
